export const types = {
    '一年级上':
        ['5以内加法或减法',
            '10以内加法或减法',
            '10以内连加或连减',
            '10以内加减混合',
            '10加个位数',
            '20以内进位加法'],

    '一年级下':
        ['20以内退位减法',
            '20以内加法或减法',
            '整十加减整十',
            '两位数加减一位整十',
            '20以内连加或连减',
            '20以内加减混合'],

    '二年级上':
        ['无进位退位加减',
            '100以内连加连减',
            '100以内加减混合',
            '6以内乘法',
            '表内乘法',
            '表内除法',
            '100以内连乘连除',
            '100以内乘除混合',
            '100以内乘加乘减'],

    '二年级下':
        ['几百几十相加或减',
            '几千几百相加或减',
            '几百加减几千几百',
            '三位数加减法',
            '两位进位退位加减',
            '表内乘、除法',
            '有余数除法',
            '两位数连加或连减',
            '两位数加减混合'],

    '三年级上':
        ['整十整百乘一位数',
            '整十整百除一位数',
            '两位三位乘一位数',
            '两位数除以一位数',
            '三位数乘或除一位数',
            '乘除混合运算'],

    '三年级下':
        ['两位数乘除一位数',
            '三位数乘或除一位数',
            '整十整百乘一位数',
            '两位数乘两位数',
            '两位数连乘',
            '两位数乘加乘减混合',
            '两位数四则混合运算'],

    '四年级上':
        ['三位整数加减法',
            '二、三位数乘一位数',
            '二、三位数除一位数',
            '二、三位数除整十数',
            '三位数除以两位数',
            '被除数除数末尾含0',
            '三位数两步混合运算',
            '三位数四则混合运算'],

    '四年级下':
        ['三位整数加减法',
            '两位乘一位或整十数',
            '两位三位除个位整十',
            '两位数乘整十数',
            '整百数乘整十数',
            '三位数乘两位',
            '三位数四测混合运算',
            '简便运算'],

    '五年级上':
        ['待升级'],

    '五年级下':
        ['简单小数运算',
            '小数四则综合运算',
            '小数简便运算',
            '简单方程',
            '同分母分数加减',
            '带括号分数加减混合'],

    '六年级上':
        ['待升级'],

    '六年级下':
        ['各类型数字一步运算',
            '各类型数字四则运算',
            '各类型数字简便运算',
            '解方程',
            '解比例']
};

export const typeIndex = {
    0: [0, 1, 2, 3, 4, 5],
    1: [10, 11, 12, 13, 14, 15],
    2: [20, 21, 22, 23, 24, 25, 26, 27, 28],
    3: [30, 31, 32, 33, 34, 35, 36, 37, 38],
    4: [40, 41, 42, 43, 44, 45],
    5: [[50, 51, 52, 53, 54, 55, 56],
        [10, 10, 10, 12, 15, 13, 14]
    ],
    6: [[60, 61, 62, 63, 64, 65, 66, 67],
        [11, 12, 13, 14, 15, 16, 17, 18]
    ],
    7: [[70, 71, 72, 73, 74, 75, 76],
        [21, 22, 23, 24, 25, 26, 27]
    ],
    8: [[80],
        [15]
    ],
    9: [[90, 91, 92, 93, 94, 95],
        [31, 32, 33, 34, 35, 36]
    ],
    10:[[100],
        [13]
    ],
    11:[
        [110, 111, 112, 113, 114],
        [15, 20, 25, 30, 35]
    ]
};

// export const grades = ['一年级', '二年级', '三年级', '四年级', '五年级', '六年级'],
