//
//  config/config.js
//  by sean wang
//  2020.9.3
//

export const types = [
    {
        grade:'一年级上', 
        type:['5以内加法或减法', '10以内加法或减法', '10以内连加或连减', '10以内加减混合', '10加个位数', '20以内进位加法'], 
        typeIndex: [0, 1, 2, 3, 4, 5],
        count: [0, 0, 0, 0, 0, 0],
        fsize: [54, 54, 54, 54, 54, 54]
    },
    {
        grade:'一年级下', 
        type:['20以内退位减法', '20以内加法或减法', '整十加减整十', '两位数加减一位整十', '20以内连加或连减', '20以内加减混合'], 
        typeIndex: [10, 11, 12, 13, 14, 15],
        count: [0, 0, 0, 0, 0, 0],
        fsize: [54, 54, 54, 54, 54, 54]
    },
    {
        grade:'二年级上', 
        type:['无进位退位加减', '100以内连加连减', '100以内加减混合', '6以内乘法', '表内乘法', '表内除法', '100以内连乘连除', '100以内乘除混合', '100以内乘加乘减'], 
        typeIndex: [20, 21, 22, 23, 24, 25, 26, 27, 28], 
        count: [0, 0, 0, 0, 0, 0, 0, 0, 0],
        fsize: [54, 54, 54, 54, 54, 54, 54, 54, 54]
    },
    {
        grade:'二年级下', 
        type:['几百几十相加或减', '几千几百相加或减', '几百加减几千几百', '三位数加减法', '两位进位退位加减', '表内乘、除法', '有余数除法', '两位数连加或连减', '两位数加减混合'], 
        typeIndex: [30, 31, 32, 33, 34, 35, 36, 37, 38], 
        count: [0, 0, 0, 0, 0, 0, 0, 0, 0],
        fsize: [54, 54, 54, 54, 54, 54, 54, 54, 54]
    },
    {
        grade:'三年级上', 
        type:['整十整百乘一位数', '整十整百除一位数', '两位三位乘一位数', '两位数除以一位数', '三位数乘或除一位数', '乘除混合运算'], 
        typeIndex: [40, 41, 42, 43, 44, 45], 
        count: [0, 0, 0, 0, 0, 0],
        fsize: [54, 54, 54, 54, 54, 54]
    },
    {
        grade:'三年级下', 
        type:['两位数乘除一位数', '三位数乘或除一位数', '整十整百乘一位数', '两位数乘两位数', '两位数连乘', '两位数乘加乘减混合', '两位数四则混合运算'], 
        typeIndex: [50, 51, 52, 53, 54, 55, 56], 
        count: [0, 0, 0, 0, 0, 0, 195],
        fsize: [54, 54, 54, 54, 54, 54, 48]
    },
    {
        grade:'四年级上', 
        type:['三位整数加减法', '二、三位数乘一位数', '二、三位数除一位数', '二、三位数除整十数', '三位数除以两位数', '被除数除数末尾含0', '三位数两步混合运算', '三位数四则混合运算'], 
        typeIndex: [60, 61, 62, 63, 64, 65, 66, 67], 
        count:  [0, 0, 0, 0, 0, 0, 35, 137],
        fsize: [54, 54, 54, 54, 54, 54, 36, 36]
    },
    {
        grade:'四年级下', 
        type:['三位整数加减法', '两位乘一位或整十数', '两位三位除个位整十', '两位数乘整十数', '整百数乘整十数', '三位数乘两位', '三位数四测混合运算','简便运算'], 
        typeIndex: [70, 71, 72, 73, 74, 75, 76, 77], 
        count: [0, 0, 0, 0, 0, 0, 239, 256],
        fsize: [54, 54, 54, 54, 54, 54, 36, 36]
    },
    {
        grade:'五年级上', 
        type:['整数四则运算', '整数简便运算', '小数加减法', '小数乘除法', '小数四则运算'], 
        typeIndex: [80, 81, 82, 83, 84], 
        count: [71, 40, 352, 215, 108],
        fsize: [36, 36, 36, 36, 36]
    },
    {
        grade:'五年级下', 
        type:['简单小数运算', '小数四则综合运算', '小数简便运算', '简单方程', '同分母分数加减', '带括号分数加减混合'], 
        typeIndex: [90, 91, 92, 93, 94, 95], 
        count: [0, 112, 54, 58, 0, 68],
        fsize: [36, 36, 36, 36, 54, 54]
    },
    {
        grade:'六年级上', 
        type:['整数小数四则运算', '分数加减法', '分数乘除法', '分数四则运算', '带分数的简便运算', '分数方程'], 
        typeIndex: [100, 101, 102, 103, 104, 105], 
        count: [16, 90, 258, 93, 31, 107],
        fsize: [36, 54, 54, 54, 54, 54]
    },
    {
        grade:'六年级下', 
        type:['各类型数字一步运算','各类型数字四则运算', '各类型数字简便运算', '解方程', '解比例'], 
        typeIndex: [110, 111, 112, 113, 114], 
        count: [15, 20, 25, 30, 35],
        fsize: [54, 54, 54, 54, 54]
    }
];
